// 1. 거듭제곱
let x = 10;
x **= 5;

// 2. 나눈 나머지
let y = 10;
y %= 5;

document.getElementById("one").innerHTML =
"1. 거듭제곱 : " + x + "<br>" + 
"2. 나눈 나머지 : " + y + "<br>"

// ----------------------------------------------------------------------------------------- 비교연산자 ▼

let num1 = 1;
let num2 = "1";
let result = num1 == num2; //참
let result2 = num1 === num2; //거짓

let num3 = 10;
let num4 = 3;
let result3 = num4 > num3; //거짓

document.getElementById("two").innerHTML = 
"타입을 고려하지 않은 같음(==), 결과 값은 " + result + "<br>" + 
"타입까지 고려하여 엄격하게 같음(===), 결과 값은 " + result2 + "<br>" + 
"변수의 수를 비교할 때, 결과 값은 " + result3 + "<br>"

// ----------------------------------------------------------------------------------------- 논리연산자 ▼

let q = 6;
let w = 3;

document.getElementById("three").innerHTML = 
"&& 는 and이기 때문에 두 개의 조건 모두 일치해야 함 " + "<br>" + 
"(q < 10 && w > 1) 는 " + (q < 10 && w > 1) + "입니다" + "<br>" + 
"(q < 10 && w < 1) 는 " + (q < 10 && w < 1) + "입니다" + "<br>" +
"(q == 10 && w == 1) 는 " + (q == 10 && w == 1) + "입니다" + "<br>" + 
"(q == 6 && w == 3) 는 " + (q == 6 && w == 3) + "입니다" + "<br>" +
"!(q === w) 는 " + !(q === w) + "입니다" + "<br>" +
"!(q > w) 는 " + !(q > w) + "입니다"